In [1]:
# Establish dependencies

import pandas as pd

import os

In [2]:
# Path and importing data

full_student_data = os.path.join('Resources/new_full_student_data.csv')

student_df = pd.read_csv(full_student_data)

# Verify data imported properly
student_df.head()

,student_id,student_name,grade,school_name,reading_score,math_score,school_type,school_budget
0,103880842,Travis Martin,9th,Sullivan High School,59.0,88.2,Public,961125
1,45069750,Michael Brown,9th,Dixon High School,94.7,73.5,Charter,870334
2,45024902,Gabriela Lucero,9th,Wagner High School,89.0,70.4,Public,846745
3,62582498,Susan Richardson,9th,Silva High School,69.7,80.3,Public,991918
4,16437227,Sherry Davis,11th,Bowers High School,NaN,27.5,Public,848324

In [3]:
# Total number on NaN values
student_df.isnull().sum()

student_id          0
student_name        0
grade               0
school_name         0
reading_score    1968
math_score        982
school_type         0
school_budget       0
dtype: int64

In [4]:
# Removal of null values and verfied removal
sdf = student_df.dropna()
sdf.isnull().sum()

student_id       0
student_name     0
grade            0
school_name      0
reading_score    0
math_score       0
school_type      0
school_budget    0
dtype: int64

In [5]:
# Checking for duplicated rows

sdf.duplicated().sum()

1836

In [6]:
# Drop duplicated rows and verify removal
sdf = sdf.drop_duplicates()
sdf.duplicated().sum()

0

In [7]:
# Checking data types
sdf.dtypes

student_id         int64
student_name      object
grade             object
school_name       object
reading_score    float64
math_score       float64
school_type       object
school_budget      int64
dtype: object

In [8]:
#Examine grade column
sdf['grade']

0         9th
1         9th
2         9th
3         9th
5         9th
         ...
19508    10th
19509    12th
19511    11th
19512    11th
19513    12th
Name: grade, Length: 14831, dtype: object

In [9]:
# Removing non-numeric charcaters and verifying the contents of the column
sdf['grade'] = sdf['grade'].str.replace('th','')
sdf['grade']

0         9
1         9
2         9
3         9
5         9
         ..
19508    10
19509    12
19511    11
19512    11
19513    12
Name: grade, Length: 14831, dtype: object

In [10]:
# Changing grade column to int and verfying the column types
sdf['grade'] = sdf['grade'].astype(int)
sdf.dtypes

student_id         int64
student_name      object
grade              int32
school_name       object
reading_score    float64
math_score       float64
school_type       object
school_budget      int64
dtype: object

In [11]:
# Summary Statistics for the student data frame
sdf.describe()

         student_id         grade  reading_score    math_score  school_budget
count  1.483100e+04  14831.000000   14831.000000  14831.000000   14831.000000
mean   6.975296e+07     10.355539      72.357865     64.675733  893742.749107
std    3.452909e+07      1.097728      15.224590     15.844093   53938.066467
min    1.000906e+07      9.000000      10.500000      3.700000  817615.000000
25%    3.984433e+07      9.000000      62.200000     54.500000  846745.000000
50%    6.965978e+07     10.000000      73.800000     65.300000  893368.000000
75%    9.927449e+07     11.000000      84.000000     76.000000  956438.000000
max    1.299997e+08     12.000000     100.000000    100.000000  991918.000000

In [12]:
# Math score mean
sdf['math_score'].mean()

64.67573326141189

In [13]:
# New variable to get minimum reading score
min_reading_score = sdf['reading_score'].min()
min_reading_score

10.5

In [14]:
# Utilizing loc to display grade column
sdf.loc[:, ["grade"]]

       grade
0          9
1          9
2          9
3          9
5          9
...      ...
19508     10
19509     12
19511     11
19512     11
19513     12

[14831 rows x 1 columns]

In [15]:
# iloc to display first 3 rows and columns 3,4,5

sdf.iloc[0:3, [3, 4, 5]]

            school_name  reading_score  math_score
0  Sullivan High School           59.0        88.2
1     Dixon High School           94.7        73.5
2    Wagner High School           89.0        70.4

In [16]:
# Grade nine summary statistics
sdf.loc[sdf["grade"] < 10].describe()

         student_id   grade  reading_score   math_score  school_budget
count  4.132000e+03  4132.0    4132.000000  4132.000000    4132.000000
mean   6.979441e+07     9.0      69.236713    66.585624  898692.606002
std    3.470565e+07     0.0      15.277354    16.661533   54891.596611
min    1.000906e+07     9.0      17.900000     5.300000  817615.000000
25%    3.953848e+07     9.0      59.000000    56.000000  846745.000000
50%    6.984037e+07     9.0      70.050000    67.800000  893368.000000
75%    9.939504e+07     9.0      80.500000    78.500000  957299.000000
max    1.299997e+08     9.0      99.900000   100.000000  991918.000000

In [17]:
# New variable using loc to get min reading row
min_reading_row = sdf.loc[sdf["reading_score"] == min_reading_score]
min_reading_row

,student_id,student_name,grade,school_name,reading_score,math_score,school_type,school_budget
3706,81758630,Matthew Thomas,10,Dixon High School,10.5,58.4,Charter,870334

In [18]:
#Variable to indicate grade 10 from sdf data
sdf_ten = sdf.loc[sdf["grade"] == 10]


# Dixon High School 10th graders reading scores using loc function with conditionals
sdf_ten.loc[sdf_ten["school_name"] == "Dixon High School",["school_name", "reading_score",]]

             school_name  reading_score
45     Dixon High School           71.1
60     Dixon High School           59.5
69     Dixon High School           88.6
94     Dixon High School           81.5
100    Dixon High School           95.3
...                  ...            ...
19283  Dixon High School           52.9
19306  Dixon High School           58.0
19344  Dixon High School           38.0
19368  Dixon High School           84.4
19445  Dixon High School           43.9

[569 rows x 2 columns]

In [19]:
# Finding the reading score mean using loc method for grades 11 and 12
sdf.loc[sdf["grade"] >= 11, 'reading_score'].mean()

74.90038089192188

In [20]:
## District vs Charter comparison
# Average budget per school type

sdf_budget = sdf.groupby(by = 'school_type').mean()
sdf_budget.loc[:, ["school_budget"]]

             school_budget
school_type
Charter      872625.656236
Public       911195.558251

In [32]:
# Count of how many student per school
student_count_sdf = sdf["school_name"].value_counts()
student_count_sdf.head(15)

Montgomery High School    2038
Green High School         1961
Dixon High School         1583
Wagner High School        1541
Silva High School         1109
Woods High School         1052
Sullivan High School       971
Turner High School         846
Bowers High School         803
Fisher High School         798
Richard High School        551
Campos High School         541
Odonnell High School       459
Campbell High School       407
Chang High School          171
Name: school_name, dtype: int64

In [22]:
# Using Groupby to seperate the the schools

grouped_school = sdf.groupby(['school_name'])

grouped_school.count().head()

,student_id,student_name,grade,reading_score,math_score,school_type,school_budget
school_name,,,,,,,
Bowers High School,803,803,803,803,803,803,803
Campbell High School,407,407,407,407,407,407,407
Campos High School,541,541,541,541,541,541,541
Chang High School,171,171,171,171,171,171,171
Dixon High School,1583,1583,1583,1583,1583,1583,1583

In [37]:
# DataFrame for School student count from largest to smallest

student_count_summary = pd.DataFrame({"Student Count": student_count_sdf})

student_count_summary.head(15)

                        Student Count
Montgomery High School           2038
Green High School                1961
Dixon High School                1583
Wagner High School               1541
Silva High School                1109
Woods High School                1052
Sullivan High School              971
Turner High School                846
Bowers High School                803
Fisher High School                798
Richard High School               551
Campos High School                541
Odonnell High School              459
Campbell High School              407
Chang High School                 171

In [39]:
# Average Math score vs school type

sdf_math = sdf.groupby(by = 'school_type').mean()
sdf_math.loc[:, ["math_score"]]

             math_score
school_type
Charter       66.761883
Public        62.951576

In [40]:
# Average reading score vs school type

sdf_reading = sdf.groupby(by = 'school_type').mean()
sdf_reading.loc[:, ["reading_score"]]

             reading_score
school_type
Charter          72.450603
Public           72.281219

In [62]:
# Using groupby to seperate data to school type and grade values

avg_by_school_type = sdf.groupby(['school_type', 'grade']).mean().round()
avg_by_school_type.loc[:, ["math_score", "reading_score"]]

                   math_score  reading_score
school_type grade
Charter     9            70.0           69.0
            10           66.0           70.0
            11           68.0           81.0
            12           60.0           70.0
Public      9            64.0           70.0
            10           64.0           73.0
            11           59.0           73.0
            12           64.0           73.0